In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os

print(os.getcwd())
df = pd.read_csv("../docs/SalesDataset.csv")

F:\AI_ML\Python projects\AI Assignments\Practise\EDA

In [3]:
df.head()

,Unnamed: 0,Date,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,0,24-11-2023,Male,34,Beauty,3,50,150
1,1,27-02-2023,Female,26,Clothing,2,500,1000
2,2,13-01-2023,Male,50,Electronics,1,30,30
3,3,21-05-2023,Male,37,Clothing,1,500,500
4,4,06-05-2023,Male,30,Beauty,2,50,100

In [13]:
df1 = df['Total Amount'].describe(percentiles=[0.25, 0.5, 0.75])
print(df1)

count    1000.00000
mean      459.00000
std       576.08213
min        25.00000
25%        60.00000
50%       135.00000
75%       900.00000
max      5000.00000
Name: Total Amount, dtype: float64

In [8]:
df['Total Amount'].var()

np.float64(331870.6206206206)

In [9]:
df['Quantity'].var()

np.float64(1.2830870870870872)

In [11]:
df[['Age','Total Amount']].corr()

                   Age  Total Amount
Age           1.000000     -0.066266
Total Amount -0.066266      1.000000

In [12]:
df[['Quantity','Total Amount']].corr()

              Quantity  Total Amount
Quantity      1.000000      0.370111
Total Amount  0.370111      1.000000

In [14]:
df[['Quantity','Total Amount']].corr()

              Quantity  Total Amount
Quantity      1.000000      0.370111
Total Amount  0.370111      1.000000

In [18]:
df = pd.read_csv("../docs/tests_results_missing.csv")
df

  TestCase   Module  Status  Duration  Defects
0      TC1    Login  Passed      12.0      0.0
1      TC2    Login  Failed       NaN      2.0
2      TC3  Payment  Passed      20.0      NaN
3      TC4  Payment  Failed      18.0      3.0
4      TC5  Reports     NaN      25.0      0.0

In [21]:
df.isnull().sum()

TestCase    0
Module      0
Status      1
Duration    1
Defects     1
dtype: int64

In [24]:
df['Duration'] = df['Duration'].fillna(df['Duration'].mean())

In [28]:
df['Status'] = df['Status'].fillna("Unknown")

In [33]:
cleaned_df = df.dropna()

In [34]:
print(cleaned_df)

  TestCase   Module   Status  Duration  Defects
0      TC1    Login   Passed     12.00      0.0
1      TC2    Login   Failed     18.75      2.0
3      TC4  Payment   Failed     18.00      3.0
4      TC5  Reports  Unknown     25.00      0.0

In [4]:
df[['Age','Total Amount']].corr()

                   Age  Total Amount
Age           1.000000     -0.066266
Total Amount -0.066266      1.000000

In [6]:
df['Age'].var()

np.float64(187.18151751751753)

In [7]:
df['Age'].std()

np.float64(13.681429659122527)

In [15]:
df['Quantity'].cov(df['Total Amount'])/(df['Quantity'].std() * df['Total Amount'].std())

np.float64(0.3701114877252194)